Code/DockerPostfix/webpageAndMonitoring.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Webpage + Monitoring Assignment</title>
<!-- 2015-05-03 Sun 14:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />
</head>
<body>
<div id="content">
<h1 class="title">Webpage + Monitoring Assignment</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Your Goal</a></li>
<li><a href="#sec-3">3. Grading</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a little assignment to get you used to Docker.  It will
require you to spend a little time poking around in the documentation
for docker and other Unix tools, but it hopefully shouldn't be too
hard.  If you are really unfamiliar with Unix, be sure to start early
and get plenty of help if you need it.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Your Goal</h2>
<div class="outline-text-2" id="text-2">
<p>
You must build a docker container that can be built with a Dockerfile
script and invokes the proper stuff with a Dockerfile CMD directive.
</p>

<p>
Your container should:
</p>

<ol class="org-ol">
<li>Run a webserver (could be anything, though I suggest apache) than
can serve an html page (could be the default one, I don't care).
Your webserver should be accessible from port 8888 on the <b>host</b>
(your webserver can run on whatever host you want inside the
container).
</li>
<li>Have a script you wrote that is invoked frequently (once a
minute?) using <b>cron</b>.  The script can be in the language of your
choice, though I suggest a scripting language like python, ruby,
or perl.  Note that you'll have to ensure the cron daemon is
running.
</li>
<li>The script should use webserver logfiles to determine if more than
3 404 (page not found) errors have occurred in the past hour.

<p>
There are 2 allowed ways to determine the "last hour".  You can
use the number of the hour (i.e. if I am running at 3:45 I am
looking for 404s starting at 3:00) OR you can use 60 minutes
(i.e. if I am running at 3:45 I am looking for 404s starting at
2:46).
</p>
</li>
<li>If there have been 3 404s in the last hour, the script should send
a warning email to some email address (I recommend you use my
DockerPostfix package as a starting point so you don't have to get
email working yourself).  Note that you'll have to ensure the
postfix daemon is running.
</li>
<li>(Optional) It's better if the script doesn't resend the warning
messages once it's already sent one for that particular hour.
This won't get you more points though - you'll just know in your
heart that you are a cool person.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Grading</h2>
<div class="outline-text-2" id="text-3">
<p>
Grading is out of 10 points.
</p>

<ol class="org-ol">
<li>Running webserver that can serve a page (1 point)
</li>
<li>Correct docker command to forward web traffic on the host to the
container (put it as a comment in your Dockerfile) (1 point)
</li>
<li>Script that is invoked on a regular basis using cron (1 point)
</li>
<li>Programming language of choice correctly installed and functional
(1 point)
</li>
<li>Script correctly detects 404s in the past hour (1 point)
</li>
<li>Script sends email (1 point)
</li>
<li>Built &amp; installed correctly from a Dockerfile (2 points)
</li>
<li>CMD command of the Dockerfile invokes everything with no 
intervention (2 points)
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2015-05-03 Sun 14:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
